CSI API ETABS v1

# cDesignCompositeColumn Interface

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    public interface cDesignCompositeColumn

    Public Interface cDesignCompositeColumn

    Dim instance As cDesignCompositeColumn

    public interface class cDesignCompositeColumn

    type cDesignCompositeColumn =  interface end

The cDesignCompositeColumn type exposes the following members.

Properties

| Name| Description
---|---|---
|
Eurocode_4_2004|
Top

Methods

| Name| Description
---|---|---
|
DeleteResults|
|
GetCode|  Retrieves the composite
column design code.
|
GetComboDeflection|
|
GetComboStrength|
|
GetDesignSection|
|
GetGroup|
|
GetResultsAvailable|  This
function determines if the composite column design results are available.
|
GetSummaryResults|  Retrieves
composite column design summary results
|
GetTargetDispl|
|
GetTargetPeriod|
| [ResetOverwrites](dd9e9dcb-
ff1c-dc3e-598d-973326d803cd.htm)|
|
SetAutoSelectNull|
|
SetCode|  Sets the composite
column design code.
|
SetComboDeflection|
| [SetComboStrength](b0e22ada-
cab0-5f71-21f6-c07470237d82.htm)|
|
SetDesignSection|
|
SetGroup|
|
SetTargetDispl|
|
SetTargetPeriod|
| [StartDesign](127cb62e-cc5e-2baa-
cdac-3b31c5ec0d8a.htm)|  Starts the composite column design.
|
VerifyPassed|
|
VerifySections|
Top

See Also

#### Reference

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com